dot_config/doom/modules/tools/git-patch/config.org
#+TITLE: Config
* packages
#+begin_src elisp :tangle packages.el
;; (package! magit-arcanist
;;   :recipe (:host github :repo "sideshowcoder/magit-arcanist"))
(package! git-link)
(package! magit :pin "692cc5e")
(package! forge :pin "8bace81")
#+end_src
* code-review
browse/review prs from emacs
#+begin_src emacs-lisp :tangle packages.el
(package! code-review)
#+end_src
#+begin_src emacs-lisp
(use-package! code-review
  :after forge
  :config
  (define-key magit-mode-map "R" #'code-review-forge-pr-at-point))
#+end_src
* speed up magit for monorepo [0/1]
Various things that speed magit up when working with a monorepo.
#+begin_src elisp
(use-package! magit
  :defer t
  :commands magit-status
  :config
  (remove-hook 'magit-refs-sections-hook 'magit-insert-tags)
  (remove-hook 'magit-status-headers-hook 'magit-insert-tags-header)
  (magit-add-section-hook
   'magit-status-sections-hook
   'magit-insert-unpushed-cherries
   'magit-insert-unpushed-to-upstream-or-recent
   'replace)
  (remove-hook 'magit-status-sections-hook 'magit-insert-unpulled-from-upstream))
#+end_src
Additionally, useful to add the following to your `.git/config`
#+begin_src toml :tangle no
[log]
	decorate = false
[status]
	showUntrackedFiles = no
#+end_src
* magit-arcanist
#+begin_src elisp
;; (use-package! magit-arcanist
;;   :defer t
;;   :after magit
;;   :ghook ('magit-mode-hook #'magit-arcanist-enable)
;;   :custom
;;   (magit-arcanist-key (kbd "#")))
#+end_src
* git link (for quickly getting a sourcegraph link)
| Keybinding        | Description                     |
|-------------------+---------------------------------|
| <leader> g <left> | git link: copy url to clipboard |
#+begin_src emacs-lisp
(use-package! git-link
  :after git-gutter-mode
  :general (:keymaps 'doom-leader-git-map
            "<left>" 'git-link))
#+end_src
And then in your `.git/config`:
#+begin_src toml :tangle no
[remote "sourcegraph"]
	url = https://your.sourcegraph.url/your-repo-name
[git-link]
	remote = sourcegraph
#+end_src
